benchmarks/cospec_benchmark_results_20250525_100032_facebook/opt-6.7b_facebook/opt-125m_tp1_dtp1/colocation_consolidated_selective_threshold_0.1_7_0_6_sharegpt_output.txt
INFO 05-25 11:34:55 [__init__.py:239] Automatically detected platform cuda.
Namespace(backend='vllm', base_url=None, host='127.0.0.1', port=8000, endpoint='/v1/completions', dataset_name='sharegpt', dataset_path=None, max_concurrency=None, model='facebook/opt-6.7b', tokenizer=None, use_beam_search=False, duration_minutes=5.0, logprobs=None, request_rate=6.0, burstiness=1.0, seed=0, trust_remote_code=False, disable_tqdm=False, profile=False, save_result=False, save_detailed=False, append_result=False, metadata=None, result_dir=None, result_filename=None, ignore_eos=True, percentile_metrics='ttft,tpot,itl,e2el,token_latency', metric_percentiles='99', goodput=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, random_input_len=1024, random_output_len=128, random_range_ratio=0.0, random_prefix_len=0, hf_subset=None, hf_split=None, hf_output_len=None, top_p=None, top_k=None, min_p=None, temperature=0.0, tokenizer_mode='auto', served_model_name=None, lora_modules=None)
Split dataset into 8126 test samples and 73136 training samples
Temperature:  0.0
Running test split to train selective validator...
Checking server health at http://127.0.0.1:8000/health
Server is ready!
Don't need to train selective validator
Running full benchmark...
Checking server health at http://127.0.0.1:8000/health
Server is ready!
Starting initial single prompt test run...
Initial test run completed. Starting main benchmark run...
Traffic request rate: 6.0
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: None
Benchmark duration: 5.0 minutes
============ Serving Benchmark Result ============
Successful requests:                     1691      
Benchmark duration (s):                  300.30    
Total input tokens:                      389832    
Total generated tokens:                  388536    
Request throughput (req/s):              5.63      
Output token throughput (tok/s):         1293.82   
Total Token throughput (tok/s):          2591.95   
---------------Time to First Token----------------
Mean TTFT (ms):                          240.46    
Median TTFT (ms):                        224.54    
P99 TTFT (ms):                           521.82    
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          30.77     
Median TPOT (ms):                        25.34     
P99 TPOT (ms):                           87.94     
---------------Inter-token Latency----------------
Mean ITL (ms):                           120.98    
Median ITL (ms):                         105.66    
P99 ITL (ms):                            312.30    
----------------End-to-end Latency----------------
Mean E2EL (ms):                          5339.19   
Median E2EL (ms):                        3793.88   
P99 E2EL (ms):                           22842.34  
-----Token Latency (e2e_latency / output_len)-----
Mean Token Latency (ms):                 37.15     
Median Token Latency (ms):               27.61     
P99 Token Latency (ms):                  114.86    
==================================================